In [2]:
# Reading data 

import pandas as pd

first_table = pd.read_csv('.\pandas\customer_details.csv')

import pandas as pd

second_table = pd.read_csv('.\pandas\customer_policy_details.csv')

print(first_table.head())
print(second_table.head())

     0       1     2    3     4    5          6    7
0  1.0    Male  44.0  1.0  28.0  0.0  > 2 Years  Yes
1  2.0    Male  76.0  1.0   3.0  0.0   1-2 Year   No
2  3.0    Male  47.0  1.0  28.0  0.0  > 2 Years  Yes
3  4.0    Male  21.0  1.0  11.0  1.0   < 1 Year   No
4  5.0  Female  29.0  1.0  41.0  1.0   < 1 Year   No
     0        1      2      3    4
0  1.0  40454.0   26.0  217.0  1.0
1  2.0  33536.0   26.0  183.0  0.0
2  3.0  38294.0   26.0   27.0  1.0
3  4.0  28619.0  152.0  203.0  0.0
4  5.0  27496.0  152.0   39.0  0.0

In [3]:
# Giving column names to first table

first_table_labels = {'0':'customer_id','1':'Gender','2':'age','3':'driving licence present','4':'region code','5':'previously insured','6':'vehicle age','7':'vehicle damage'}

In [7]:
# Checking and cleaning Data Quality
# Null Values

for i in range(first_table.shape[1]):
    print(f"number of cells of{first_table[str(i)]}with null values={first_table[str(i)].isnull().sum()}")
    
first_table.info()

number of cells of0              1.0
1              2.0
2              3.0
3              4.0
4              5.0
            ...
381104    381105.0
381105    381106.0
381106    381107.0
381107    381108.0
381108    381109.0
Name: 0, Length: 380723, dtype: float64with null values=0
number of cells of0           Male
1           Male
2           Male
3           Male
4         Female
           ...
381104      Male
381105      Male
381106      Male
381107    Female
381108      Male
Name: 1, Length: 380723, dtype: objectwith null values=368
number of cells of0         44.0
1         76.0
2         47.0
3         21.0
4         29.0
          ...
381104    74.0
381105    30.0
381106    21.0
381107    68.0
381108    46.0
Name: 2, Length: 380723, dtype: float64with null values=366
number of cells of0         1.0
1         1.0
2         1.0
3         1.0
4         1.0
         ...
381104    1.0
381105    1.0
381106    1.0
381107    1.0
381108    1.0
Name: 3, Length: 380723, dtype: float64with null values=392
number of cells of0         28.0
1          3.0
2         28.0
3         11.0
4         41.0
          ...
381104    26.0
381105    37.0
381106    30.0
381107    14.0
381108    29.0
Name: 4, Length: 380723, dtype: float64with null values=391
number of cells of0         0.0
1         0.0
2         0.0
3         1.0
4         1.0
         ...
381104    1.0
381105    1.0
381106    1.0
381107    0.0
381108    0.0
Name: 5, Length: 380723, dtype: float64with null values=381
number of cells of0         > 2 Years
1          1-2 Year
2         > 2 Years
3          < 1 Year
4          < 1 Year
            ...
381104     1-2 Year
381105     < 1 Year
381106     < 1 Year
381107    > 2 Years
381108     1-2 Year
Name: 6, Length: 380723, dtype: objectwith null values=381
number of cells of0         Yes
1          No
2         Yes
3          No
4          No
         ...
381104     No
381105     No
381106     No
381107    Yes
381108     No
Name: 7, Length: 380723, dtype: objectwith null values=406
<class 'pandas.core.frame.DataFrame'>
Int64Index: 380723 entries, 0 to 381108
Data columns (total 8 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   0       380723 non-null  float64
 1   1       380355 non-null  object
 2   2       380357 non-null  float64
 3   3       380331 non-null  float64
 4   4       380332 non-null  float64
 5   5       380342 non-null  float64
 6   6       380342 non-null  object
 7   7       380317 non-null  object
dtypes: float64(5), object(3)
memory usage: 26.1+ MB

In [9]:
# dropping rows with null customer_id of first_table

first_table.dropna(subset=['0'],inplace=True)
print(f"number of cells of {first_table_labels[str(0)]} with null values={first_table[str(0)].isnull().sum()}")

number of cells of customer_id with null values=0

In [11]:
# Replace all null values for numeric columns by mean of first_table

for i in range(2,6):
    first_table[str(i)].fillna(first_table[str(i)].mean(),inplace=True)
    print(f"number of cells of {first_table[str(i)]} with null values={first_table[str(i)].isnull().sum()}")

number of cells of 0         44.0
1         76.0
2         47.0
3         21.0
4         29.0
          ...
381104    74.0
381105    30.0
381106    21.0
381107    68.0
381108    46.0
Name: 2, Length: 380723, dtype: float64 with null values=0
number of cells of 0         1.0
1         1.0
2         1.0
3         1.0
4         1.0
         ...
381104    1.0
381105    1.0
381106    1.0
381107    1.0
381108    1.0
Name: 3, Length: 380723, dtype: float64 with null values=0
number of cells of 0         28.0
1          3.0
2         28.0
3         11.0
4         41.0
          ...
381104    26.0
381105    37.0
381106    30.0
381107    14.0
381108    29.0
Name: 4, Length: 380723, dtype: float64 with null values=0
number of cells of 0         0.0
1         0.0
2         0.0
3         1.0
4         1.0
         ...
381104    1.0
381105    1.0
381106    1.0
381107    0.0
381108    0.0
Name: 5, Length: 380723, dtype: float64 with null values=0

In [12]:
# replace all values for categorical value by mode of first_table

for i in [1,6,7]:
    first_table[str(i)].fillna(first_table[str(i)].mode(),inplace=True)
    print(f"number of cells of {first_table_labels[str(i)]} with null values={first_table[str(i)].isnull().sum()}")

number of cells of Gender with null values=368
number of cells of vehicle age with null values=381
number of cells of vehicle damage with null values=406

In [14]:
# Giving column names to second_table

second_table_labels={'0':'customer_id','1':'annual_premium_INR','2':'sales_channel_code','3':'vintage','4':'response'}

# counting null values of each column of second_table
for i in range(second_table.shape[1]):
    print(f"number of cells of {second_table[str(i)]} with null values= {second_table[str(i)].isnull().sum()}")
    
second_table.info()

number of cells of 0              1.0
1              2.0
2              3.0
3              4.0
4              5.0
            ...
381104    381105.0
381105    381106.0
381106    381107.0
381107    381108.0
381108    381109.0
Name: 0, Length: 381109, dtype: float64 with null values= 387
number of cells of 0         40454.0
1         33536.0
2         38294.0
3         28619.0
4         27496.0
           ...
381104    30170.0
381105    40016.0
381106    35118.0
381107    44617.0
381108    41777.0
Name: 1, Length: 381109, dtype: float64 with null values= 346
number of cells of 0          26.0
1          26.0
2          26.0
3         152.0
4         152.0
          ...
381104     26.0
381105    152.0
381106    160.0
381107    124.0
381108     26.0
Name: 2, Length: 381109, dtype: float64 with null values= 400
number of cells of 0         217.0
1         183.0
2          27.0
3         203.0
4          39.0
          ...
381104     88.0
381105    131.0
381106    161.0
381107     74.0
381108    237.0
Name: 3, Length: 381109, dtype: float64 with null values= 388
number of cells of 0         1.0
1         0.0
2         1.0
3         0.0
4         0.0
         ...
381104    0.0
381105    0.0
381106    0.0
381107    0.0
381108    0.0
Name: 4, Length: 381109, dtype: float64 with null values= 361
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 381109 entries, 0 to 381108
Data columns (total 5 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   0       380722 non-null  float64
 1   1       380763 non-null  float64
 2   2       380709 non-null  float64
 3   3       380721 non-null  float64
 4   4       380748 non-null  float64
dtypes: float64(5)
memory usage: 14.5 MB

In [15]:
# dropping rows with null customer_id of second_table

second_table.dropna(subset=['0'],inplace=True)
print(f"number of cells of {second_table_labels[str(0)]} with null values={second_table[str(0)].isnull().sum()}")

number of cells of customer_id with null values=0

In [16]:
# Replacing all null values for numeric by mean of second_table

for  i in range(1,5):
    second_table[str(i)].fillna(second_table[str(i)].mean(),inplace=True)
    print(f"number of cells of {second_table[str(i)]} with null values={second_table[str(i)].isnull().sum()}")

number of cells of 0         40454.0
1         33536.0
2         38294.0
3         28619.0
4         27496.0
           ...
381104    30170.0
381105    40016.0
381106    35118.0
381107    44617.0
381108    41777.0
Name: 1, Length: 380722, dtype: float64 with null values=0
number of cells of 0          26.0
1          26.0
2          26.0
3         152.0
4         152.0
          ...
381104     26.0
381105    152.0
381106    160.0
381107    124.0
381108     26.0
Name: 2, Length: 380722, dtype: float64 with null values=0
number of cells of 0         217.0
1         183.0
2          27.0
3         203.0
4          39.0
          ...
381104     88.0
381105    131.0
381106    161.0
381107     74.0
381108    237.0
Name: 3, Length: 380722, dtype: float64 with null values=0
number of cells of 0         1.0
1         0.0
2         1.0
3         0.0
4         0.0
         ...
381104    0.0
381105    0.0
381106    0.0
381107    0.0
381108    0.0
Name: 4, Length: 380722, dtype: float64 with null values=0

In [19]:
# Outliers
# first_table

first_table_limits={}
for i in range(2,6):
    computations=first_table[str(i)].describe(percentiles=[.25,.75])
    mean = computations.values[1]
    Q1 = computations.values[4]
    Q3 = computations.values[6]
    IQR = Q3 - Q1
    lower_limit=Q1-1.5*IQR
    higher_limit=Q3+1.5*IQR
    first_table_limits[str(i)] = (lower_limit,higher_limit)
    first_table_limits

In [20]:
# generating a summary of count of all outliers column wise of first_table(only for numeric columns)

first_table_outliers={'2':0,'3':0,'4':0,'5':0}

for j in first_table.index:
    for i in range(2,6):
        if(first_table_limits[str(i)][0]!=first_table_limits[str(i)][1]) and (first_table.loc[j,str(i)]>first_table_limits[str(i)][1]<first_table_limits[str(i)][0]):
            first_table_outliers[str(i)]+=1
first_table_outliers

{'2': 0, '3': 0, '4': 0, '5': 0}

In [21]:
# replacing all outliers for numeric columns by mean for first_table

for j in first_table.index:
    for i in range(2,6):
        if first_table.loc[j,str(i)]<first_table_limits[str(i)][0]:
            first_table.loc[j,str(i)]=first_table[str(i)].mean()
first_table_outliers

{'2': 0, '3': 0, '4': 0, '5': 0}

In [22]:
# second_table

second_table_limits={}

for i in range(1,5):
    computations=second_table[str(i)].describe(percentiles=[.25,.75])
    mean=computations.values[1]
    Q1=computations.values[4]
    Q3=computations.values[6]
    IQR=Q3-Q1
    lower_limit=Q1-1.5*IQR
    higher_limit=Q3+1.5*IQR
    second_table_limits[str(i)]=(lower_limit,higher_limit)
second_table_limits

{'1': (1952.375, 61855.375),
 '2': (-155.5, 336.5),
 '3': (-135.5, 444.5),
 '4': (0.0, 0.0)}

In [23]:
# generating a summary of count of all outliers column wise of second_table(only for numeric columns)

second_table_outliers={'1':0,'2':0,'3':0,'4':0}

for j in second_table.index:
    for i in range(1,5):
        if(second_table_limits[str(i)][0]!=second_table_limits[str(i)][1]) and (second_table.loc[j,str(i)]>second_table_limits[str(i)][1] or second_table.loc[j,str(i)]<second_table_limits[str(i)][0]):
            second_table_outliers[str(i)]+=1
second_table_outliers

{'1': 10332, '2': 0, '3': 0, '4': 0}

In [24]:
# replacing all outliers for numeric columns by mean for second_table

for j in second_table.index:
    for i in range(1,5):
        if second_table.loc[j,str(i)]<second_table_limits[str(i)][0]:
            second_table.loc[j,str(i)]=second_table[str(i)].mean()
        if second_table.loc[j,str(i)]>second_table_limits[str(i)][1]:
            second_table.loc[j,str(i)]=second_table[str(i)].mean()
second_table_outliers

{'1': 10332, '2': 0, '3': 0, '4': 0}

In [25]:
# Removing all white spaces for first_table and second_table

first_table.apply(lambda x:x.str.strip() if x.dtype == "object" else x)

second_table.apply(lambda x:x.str.strip() if x.dtype == "object" else x)

# case correction for first_table and second_table

first_table.apply(lambda x:x.str.upper() if x.dtype == "object" else x)

second_table.apply(lambda x:x.str.upper() if x.dtype == "object" else x)

# Dropping duplicated rows for first_table and second_table

first_table.drop_duplicates(inplace=True)

second_table.drop_duplicates(inplace=True)

In [26]:
# Creating a master table

Master = pd.merge(first_table,second_table,on='0')
labels={'0':'customer_id','1_x':'Gender','2_x':'age','3_x':'driving licence present','4_x':'region code','5':'previously insured',
       '6':'vehicle age','7':'vehicle damage','1_y':'annual_premium_INR','2_y':'sales_channel_code','3_y':'vintage','4_y':'response'}
Master.rename(columns=labels,inplace=True)
Master

,customer_id,Gender,age,driving licence present,region code,previously insured,vehicle age,vehicle damage,annual_premium_INR,sales_channel_code,vintage,response
0,1.0,Male,44.0,1.0,28.0,0.0,> 2 Years,Yes,40454.0,26.0,217.0,0.122526
1,2.0,Male,76.0,1.0,3.0,0.0,1-2 Year,No,33536.0,26.0,183.0,0.000000
2,3.0,Male,47.0,1.0,28.0,0.0,> 2 Years,Yes,38294.0,26.0,27.0,0.122523
3,4.0,Male,21.0,1.0,11.0,1.0,< 1 Year,No,28619.0,152.0,203.0,0.000000
4,5.0,Female,29.0,1.0,41.0,1.0,< 1 Year,No,27496.0,152.0,39.0,0.000000
...,...,...,...,...,...,...,...,...,...,...,...,...
380331,381105.0,Male,74.0,1.0,26.0,1.0,1-2 Year,No,30170.0,26.0,88.0,0.000000
380332,381106.0,Male,30.0,1.0,37.0,1.0,< 1 Year,No,40016.0,152.0,131.0,0.000000
380333,381107.0,Male,21.0,1.0,30.0,1.0,< 1 Year,No,35118.0,160.0,161.0,0.000000
380334,381108.0,Female,68.0,1.0,14.0,0.0,> 2 Years,Yes,44617.0,124.0,74.0,0.000000
380335,381109.0,Male,46.0,1.0,29.0,0.0,1-2 Year,No,41777.0,26.0,237.0,0.000000

In [27]:
# gender wise average annual_premium

result1 = Master.groupby('Gender')['annual_premium_INR'].mean()
result1

Gender
Female    29256.646108
Male      29305.360310
Name: annual_premium_INR, dtype: float64

In [28]:
# age wise average annual_premium

result2 = Master.groupby('age')['annual_premium_INR'].mean()
result2

age
20.0    26333.769642
21.0    29740.291634
22.0    29935.061500
23.0    29826.865159
24.0    30111.574448
            ...
81.0    29250.430257
82.0    36468.997951
83.0    28945.323772
84.0    35440.818182
85.0    26574.328252
Name: annual_premium_INR, Length: 67, dtype: float64

In [34]:
# Checking data balanced between genders

print(f"male to female ratio is {round(Master['Gender'].value_counts()[0] / Master['Gender'].value_counts()[1],2)}")
print(f"genrally the standard ratio is {50/50} and slightly balanced ratio to {round(55/45.2)} _ {60/40} but the imbalanced ratio is {80/40} _ {90/10}")

male to female ratio is 1.18
genrally the standard ratio is 1.0 and slightly balanced ratio to 1 _ 1.5 but the imbalanced ratio is 2.0 _ 9.0

In [35]:
# Vehicle age wise average annual_premium

result3 = Master.groupby('vehicle age')['annual_premium_INR'].mean()
result3

vehicle age
1-2 Year     29079.463376
< 1 Year     29175.762528
> 2 Years    32904.973757
Name: annual_premium_INR, dtype: float64

In [36]:
# Checking relation between person age and annual_premium

n = Master['age'].corr(Master['annual_premium_INR'])
if n < -0.5:
    print("Strong negative relationship")
if n > 0.5:
    print("Strong positivr relationship")
if n > -0.5 and n < 0.5:
    print("There is no relationship!")

There is no relationship!